{"config": {"name": "model_20", "input_layers": [["input_23", 0, 0]], "layers": [{"name": "input_23", "config": {"sparse": false, "batch_input_shape": [null, 34], "dtype": "float32", "name": "input_23"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_13", "config": {"name": "embedding_13", "batch_input_shape": [null, 34], "embeddings_regularizer": null, "input_dim": 3749, "activity_regularizer": null, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "dtype": "float32", "trainable": false, "input_length": 34, "embeddings_constraint": null, "mask_zero": false, "output_dim": 100}, "class_name": "Embedding", "inbound_nodes": [[["input_23", 0, 0, {}]]]}, {"name": "bidirectional_13", "config": {"name": "bidirectional_13", "trainable": true, "merge_mode": "concat", "layer": {"config": {"recurrent_dropout": 0.0, "activation": "tanh", "units": 100, "dropout": 0.25, "trainable": true, "unroll": false, "return_state": false, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_13", "kernel_regularizer": null, "go_backwards": false, "implementation": 1, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "stateful": false, "recurrent_constraint": null, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": true, "bias_constraint": null, "use_bias": true, "kernel_constraint": null}, "class_name": "LSTM"}}, "class_name": "Bidirectional", "inbound_nodes": [[["embedding_13", 0, 0, {}]]]}, {"name": "time_distributed_6", "config": {"name": "time_distributed_6", "trainable": true, "layer": {"config": {"name": "dense_37", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "units": 100, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}}, "class_name": "TimeDistributed", "inbound_nodes": [[["bidirectional_13", 0, 0, {}]]]}, {"name": "flatten_3", "config": {"name": "flatten_3", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten", "inbound_nodes": [[["time_distributed_6", 0, 0, {}]]]}, {"name": "dense_38", "config": {"name": "dense_38", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "units": 100, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["flatten_3", 0, 0, {}]]]}, {"name": "dense_39", "config": {"name": "dense_39", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "softmax", "units": 4, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["dense_38", 0, 0, {}]]]}], "output_layers": [["dense_39", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Model"}